In [1]:
import numpy as np
import pandas as pd
import mysql.connector
import sqlalchemy as alc

In [2]:
## CREATE CONNECTION
mydb = mysql.connector.connect(host='localhost',user= 'root',
                               passwd='Propayers140610', database= 'sakila')

In [4]:
## SHOW FULL TABLES SAKILA
mycursor = mydb.cursor()
mycursor.execute('''show full tables;''')
myresult = mycursor.fetchall()

columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
# tables

### 1. 10 film komedi dengan durasi tersingkat.

In [8]:
# memilih kolom title, category, length dari tabel film_list
## melakukan konditional kategori= komedi
## mengurutkan berdasarkan durasi film
## membatasi 10 film
mycursor = mydb.cursor()
mycursor.execute('''select title, category, length
from film_list
where category='comedy'
order by length
limit 10;;''')
myresult = mycursor.fetchall()

columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

              title category  length
0   DOWNHILL ENOUGH   Comedy      47
1    HEAVEN FREEDOM   Comedy      48
2  PARADISE SABRINA   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4         ZORRO ARK   Comedy      50
5        LION UNCUT   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

### 2. Daftar kategori film beserta jumlah film tiap kategori & rata-rata harga sewa DVD film tiap kategori. Urutkan data dari kategori dengan jumlah film terbanyak.

In [13]:
## memilih category, count(title) as JumlahMovie, avg(price) as RataHargaSewa dri tabel film_list
## mengelompokkan berdasarkan kategori
## mebgurutkan berdasarkan jumlah movie
mycursor = mydb.cursor()
mycursor.execute('''select category, count(title) as JumlahMovie, avg(price) as RataHargaSewa
from film_list
group by category
order by JumlahMovie desc
;''')
myresult = mycursor.fetchall()

columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

       category  JumlahMovie RataHargaSewa
0       Foreign           73      3.099589
1        Sports           73      3.099589
2        Family           69      2.758116
3   Documentary           68      2.666471
4     Animation           66      2.808182
5        Action           64      2.646250
6           New           63      3.116984
7        Sci-Fi           61      3.219508
8         Drama           61      2.990000
9         Games           61      3.252295
10     Children           60      2.890000
11       Comedy           58      3.162414
12     Classics           57      2.744386
13       Horror           56      3.025714
14       Travel           56      3.275714
15        Music           51      2.950784

### 3. Daftar 10 aktor/aktris yang paling banyak membintangi film. Kolom yang ditampilkan minimal: id aktor, nama depan, nama belakang dan jumlah film yang dibintangi. Kemudian urutkan dari aktor/aktris yang membintangi film terbanyak.

In [35]:
## memilih actor_id, first_name, last_name, count(film_id) as jumlah_movie dari table actor
## melakukan  join table film actor dengan kolom yang sama yaitu actor id
## mengelompokkan berdasarkan actor id
## mengurutukan berdasarkan jumlah_movie dan actor_id
mycursor = mydb.cursor()
mycursor.execute('''select actor_id, first_name, last_name, count(film_id) as jumlah_movie
from actor 
join film_actor using (actor_id)
group by actor_id
order by jumlah_movie desc, actor_id desc
limit 10;''')
myresult = mycursor.fetchall()

columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

   actor_id first_name    last_name  jumlah_movie
0       107       GINA    DEGENERES            42
1       102     WALTER         TORN            41
2       198       MARY       KEITEL            40
3       181    MATTHEW       CARREY            39
4        23     SANDRA       KILMER            37
5        81   SCARLETT        DAMON            36
6       158     VIVIEN     BASINGER            35
7       144     ANGELA  WITHERSPOON            35
8       106    GROUCHO        DUNST            35
9        60      HENRY        BERRY            35

### 4. Kategori film apakah yang paling banyak dibintangi Gina Degeneres? Untuk mengetahuinya, tampilkan daftar kategori film beserta jumlah film yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu kategori film dan jumlah film yang dibintangi.

In [34]:
mycursor = mydb.cursor()
mycursor.execute('''select category, count(f.title) as jumlah_Movie
from film_list f, actor
inner join film_actor on film_actor.actor_id = actor.actor_id
join film on film.film_id = film_actor.film_id
where actor.first_name = 'GINA' and actor.last_name = 'DEGENERES' 
group by category
;''')
myresult = mycursor.fetchall()

columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

       category  jumlah_Movie
0   Documentary          2856
1        Horror          2352
2        Family          2898
3       Foreign          3066
4        Comedy          2436
5        Sports          3066
6         Music          2142
7      Classics          2394
8     Animation          2772
9        Action          2688
10          New          2646
11       Sci-Fi          2562
12        Drama          2562
13       Travel          2352
14        Games          2562
15     Children          2520

In [61]:
# mycursor = mydb.cursor()
# mycursor.execute('''select *
# from film_list
# limit 10;''')
# myresult = mycursor.fetchall()

# columns = mycursor.column_names
# tables = pd.DataFrame(myresult, columns=columns)
# tables

### 5. Daftar judul film sci-fi yang pernah dibintangi oleh Gina Degeneres. Kolom yang diwajibkan ada yaitu judul film dan kategorinya.

In [60]:
## memilik title, kategori dari table film list
## melakukan inner join table film actor dengan kolom yang sama yaitu film id
## melakukan  join actor id
## melakukan conditional dimana nama artis gina degeneres dan kategori sci-fi
mycursor = mydb.cursor()
mycursor.execute('''select title, category
from film_list
inner join film_actor on film_actor.film_id = film_list.FID
join actor on actor.actor_id = film_actor.actor_id
where actor.first_name = 'GINA' and actor.last_name = 'DEGENERES' and category ='Sci-Fi'
;''')
myresult = mycursor.fetchall()

columns = mycursor.column_names
tables = pd.DataFrame(myresult, columns=columns)
tables

                 title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi

In [ ]:
# # film --> film.id
# film_list --> FID
# film_actor --> actor_id, film_id
# actor --> actor_id